      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG2.
       DATA DIVISION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

            DISPLAY "Hello world".
            DISPLAY 55.
            DISPLAY 12.607.
       PROGRAM-DONE.
            STOP RUN.
