       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
      *COMENTARIO
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "HELLO WOLRD".

       PROGRAM-DONE.
           STOP RUN.
